app/views/societe/index.html.erb

SELECT  `droits`.* FROM `droits` WHERE `droits`.`id` = 1 LIMIT 1
---

  <% if Droit.find(@current_user.droit_id).role == "admin" %>