app/views/anomalie/index.html.erb

SELECT  `droits`.* FROM `droits` WHERE `droits`.`id` = 1 LIMIT 1
---

<% if Droit.find(@current_user.droit_id).role == "admin" %>

SELECT  `societes`.* FROM `societes` WHERE `societes`.`id` = 1 LIMIT 1
---
      <td><%= anomalie.alerte_type %></td>
      <td><%= Societe.find(anomalie.societe_id).nom_societe %></td>