app/views/welcome/index.html.erb

SELECT  `droits`.* FROM `droits` WHERE `droits`.`id` = 2 LIMIT 1
---

  <% if Droit.find(@current_user.droit_id).role == "admin" %>