app/views/user/index.html.erb

<% if @current_user %>
  <% if Droit.find(@current_user.droit_id).role == "admin"  %>
---
SELECT  `droits`.* FROM `droits` WHERE `droits`.`id` = 1 LIMIT 1