app/views/user/show.html.erb

    <% @droits.each do |droit| %>
    <% if droit.role == Droit.find(@utilisateur.droit_id).role %>
---
SELECT  `droits`.* FROM `droits` WHERE `droits`.`id` = 1 LIMIT 1