app/controllers/anomalie_controller.rb

  def create
    @current_user = get_current_user
    if @current_user
      if check_access "admin"
        @anomalie = Anomalie.new
        @anomalie.statut = "Alerte"
        @anomalie.descriptif = params[:descriptif]
        @anomalie.date = Time.now
        @anomalie.societe = Societe.find(1)
        @anomalie.save
---
SELECT  `societes`.* FROM `societes` WHERE `societes`.`id` = 15 LIMIT 1
INSERT INTO `anomalies` (`statut`, `date`, `descriptif`, `created_at`, `updated_at`, `societe_id`) VALUES ('Alerte', '2018-04-13 07:06:35', 'test', '2018-04-13 07:06:35', '2018-04-13 07:06:35', 15)

  def index
    @current_user = get_current_user
    if @current_user
      time = Time.now
      $LOG.write "[#{Time.utc time.year, time.month, time.day, time.hour, time.min, time.sec}] user : #{@current_user.nom}, ip : #{request.remote_ip}, route : #{request.fullpath}"
      @droits = Droit.find_each
---
SELECT  `droits`.* FROM `droits` LIMIT 11

  def show
    @current_user = get_current_user
    if @current_user && check_access("admin")
      @anomalie = Anomalie.find(params[:id])
---
SELECT  `anomalies`.* FROM `anomalies` WHERE `anomalies`.`id` = NULL LIMIT 1

  def delete
    @current_user = get_current_user
    @plans = PlanActionType.find_each
    if @current_user && check_access("admin")
      @anomalie = Anomalie.find(params[:id])
      time = Time.now
      @plans.each do |p|
        if p.anomaly_id == @anomalie.id
         p.delete
---
SELECT  `plan_action_types`.* FROM `plan_action_types` ORDER BY `plan_action_types`.`id` ASC LIMIT 1000
SELECT  `anomalies`.* FROM `anomalies` WHERE `anomalies`.`id` = 1 LIMIT 1
DELETE FROM `anomalies` WHERE `anomalies`.`id` = 1

  def alerte
    @current_user = get_current_user
    time = Time.now
    if params[:realAlerte] ==  "no"
      @anomalie = Anomalie.find(params[:id])
      @anomalie.statut = "Fausse alerte"
      @anomalie.alerte_type = nil
      @anomalie.save
---
SELECT  `anomalies`.* FROM `anomalies` WHERE `anomalies`.`id` = NULL LIMIT 1
UPDATE `anomalies` SET `statut` = 'Incident', `alerte_type` = 'phishing', `updated_at` = '2018-04-11 07:56:36' WHERE `anomalies`.`id` = 1