app/controllers/plan_action_type_controller.rb

SELECT  `anomalies`.* FROM `anomalies` WHERE `anomalies`.`id` = NULL LIMIT 1
SELECT  `plan_action_types`.* FROM `plan_action_types` ORDER BY `plan_action_types`.`id` ASC LIMIT 1000
---
  def index
    @current_user = get_current_user
    if @current_user
      if check_access "admin"
        if params[:id]
          @anomalie = Anomalie.find(params[:id])
          time = Time.now
          $LOG.write "[#{Time.utc time.year, time.month, time.day, time.hour, time.min, time.sec}] user : #{@current_user.nom}, ip : #{request.remote_ip}, route : #{request.fullpath}, plan_index : {  anomalie_id: #{@anomalie.id}}"
          render layout: "layouts/application.html.erb"
        else
          @plans = PlanActionType.find_each

SELECT  `anomalies`.* FROM `anomalies` WHERE `anomalies`.`id` = NULL LIMIT 1
---
  def show
    if check_access "admin"
      @anomalie = Anomalie.find(params[:id])

SELECT  `anomalies`.* FROM `anomalies` WHERE `anomalies`.`id` = NULL LIMIT 1
INSERT INTO `plan_action_types` (`type`, `descriptif`, `liste_action`, `temps`, `priorite`, `created_at`, `updated_at`, `anomaly_id`) VALUES ('ddos', '<script>alert(\"coucou\");</script>', 'pipeau', '2018-04-11 13:17:33', 'Urgent', '2018-04-13 21:15:19', '2018-04-13 21:15:19', 11)
---
  def create
    @current_user = get_current_user
    @anomalie = Anomalie.find(params[:anomalie_id])
    if params[:anomalie_id]
      date = params[:date].to_date
      now = Date.today
      if (date.day < now.day && date.month <= now.month && date.year <= now.year) || (date.month < now.month && date.year <= now.year) || (date.year < now.year)
        flash[:date_error] = "Veuillez saisir une date correcte !"
      else
        @plan = PlanActionType.new
        @plan.incident_type = @anomalie.alerte_type
        @plan.descriptif = params[:descriptif]
        @plan.liste_action = params[:actions]
        @plan.temps = params[:date]
        @plan.priorite = params[:priorite]
        @plan.anomaly_id = @anomalie.id
        @plan.save