app/controllers/societe_controller.rb

INSERT INTO `societes` (`nom_societe`, `referent`, `mail`, `adresse`, `telephone`, `created_at`, `updated_at`) VALUES ('Lorcyber', 'Pierre', 'pierre@lorcyber.eu', 'VIPE Vannes', 41367812, '2018-04-12 14:41:21', '2018-04-12 14:41:21')
---
  def create
    @current_user = get_current_user
    if check_access "admin"
      @societe = Societe.new(societe_params)

      if @societe.save

SELECT  `societes`.* FROM `societes` WHERE `societes`.`id` = 1 LIMIT 1
---
  def show
    @current_user = get_current_user
    if @current_user
      if check_access "admin"
        @societe = Societe.find(params[:id])

SELECT  `societes`.* FROM `societes` WHERE `societes`.`id` = 1 LIMIT 1
DELETE FROM `societes` WHERE `societes`.`id` = 1
---
  def delete
    @current_user = get_current_user

    if @current_user
      if check_access "admin"
        @societe = Societe.find(params[:id])
        time = Time.now
        $LOG.write "[#{Time.utc time.year, time.month, time.day, time.hour, time.min, time.sec}] user : #{@current_user.nom}, ip : #{request.remote_ip}, route : #{request.fullpath}, deleted : { id: #{@societe.id}, nom_societe: #{@societe.nom_societe}, referent: #{@societe.referent}}"
        @societe.delete

SELECT  `societes`.* FROM `societes` WHERE `societes`.`id` = 15 LIMIT 1
UPDATE `societes` SET `nom_societe` = 'A', `referent` = 'f', `mail` = 'sdf@5', `adresse` = 'sd', `telephone` = 0, `updated_at` = '2018-04-13 07:14:09' WHERE `societes`.`id` = 17
---
  def edit
    @current_user = get_current_user
    if @current_user
      if check_access "admin"
        @societe = Societe.find(params[:id])
        @societe.nom_societe = params[:nom]
        @societe.referent = params[:ref]
        @societe.mail = params[:mail]
        @societe.adresse = params[:adresse]
        @societe.telephone = params[:tel]
        @societe.save