app/controllers/user_controller.rb

SELECT  `droits`.* FROM `droits` WHERE `droits`.`id` = NULL LIMIT 1
SELECT  `utilisateurs`.* FROM `utilisateurs` WHERE `utilisateurs`.`id` = 1 LIMIT 1
INSERT INTO `utilisateurs` (`nom`, `password`, `action_id`, `created_at`, `updated_at`, `droit_id`) VALUES ('test', 'test', 1, '2018-04-12 15:46:02', '2018-04-12 15:46:02', 2)
---
  def create
    @current_user = get_current_user
    if check_password_security
      @utilisateur = Utilisateurs.new
      @utilisateur.nom = params[:nom]
      @utilisateur.password = params[:password]
      @utilisateur.droit_id = Droit.find(params[:role]).id
      @utilisateur.save

SELECT  `utilisateurs`.* FROM `utilisateurs` WHERE `utilisateurs`.`id` = 1 LIMIT 1
SELECT  `droits`.* FROM `droits` ORDER BY `droits`.`id` ASC LIMIT 1000
---
  def show
    get_current_user
    if new_check_access("admin")
      time = Time.now
      $LOG.write "[#{Time.utc time.year, time.month, time.day, time.hour, time.min, time.sec}] user : #{@current_user.nom}, ip : #{request.remote_ip}, route : #{request.fullpath}"
      check_access "admin"
      @utilisateur = Utilisateurs.find(params[:id])
      @droits = Droit.find_each

SELECT  `droits`.* FROM `droits` ORDER BY `droits`.`id` ASC LIMIT 1000
---
  def index
    if get_current_user
      time = Time.now
      $LOG.write "[#{Time.utc time.year, time.month, time.day, time.hour, time.min, time.sec}] user : #{@current_user.nom}, ip : #{request.remote_ip}, route : #{request.fullpath}"
      @droits = Droit.find_each

SELECT  `utilisateurs`.* FROM `utilisateurs` WHERE `utilisateurs`.`id` = NULL LIMIT 1
SELECT  `droits`.* FROM `droits` WHERE `droits`.`id` = 2 LIMIT 1
UPDATE `utilisateurs` SET `role` = 'utilisateur', `action_id` = 1, `updated_at` = '2018-04-12 09:35:33' WHERE `utilisateurs`.`id` = 2
---
  def edit
    get_current_user
    @utilisateur = Utilisateurs.find(params[:id])
    @utilisateur.nom = params[:nom]
    @utilisateur.droit_id = Droit.find(params[:role]).id
    @utilisateur.save

SELECT  `utilisateurs`.* FROM `utilisateurs` WHERE `utilisateurs`.`id` = 1 LIMIT 1
DELETE FROM `utilisateurs` WHERE `utilisateurs`.`id` = 2
SELECT  `utilisateurs`.* FROM `utilisateurs` ORDER BY `utilisateurs`.`id` ASC LIMIT 1000
---
  def delete
    if get_current_user
    #  check_access "admin"
      if new_check_access "admin"
        @utilisateur = Utilisateurs.find(params[:id])
        time = Time.now
        unless last_admin?(@utilisateur)
          @utilisateur.delete
          $LOG.write "[#{Time.utc time.year, time.month, time.day, time.hour, time.min, time.sec}] user : #{@current_user.nom}, ip : #{request.remote_ip}, route : #{request.fullpath}, user : {id: #{@utilisateur.id}, name : #{@utilisateur.nom}}"
        else
          $LOG.write "[#{Time.utc time.year, time.month, time.day, time.hour, time.min, time.sec}] user : #{@current_user.nom}, ip : #{request.remote_ip}, route : #{request.fullpath}, tried to delete last admin : {id: #{@utilisateur.id}, name : #{@utilisateur.nom}}"