app/controllers/welcome_controller.rb

SELECT  `utilisateurs`.* FROM `utilisateurs` WHERE `utilisateurs`.`id` = 1 LIMIT 1
---
  def index
    if session[:user_id]
      @current_user = Utilisateurs.find(session[:user_id])

SELECT  `utilisateurs`.* FROM `utilisateurs` WHERE `utilisateurs`.`nom` = '' AND `utilisateurs`.`password` = '' ORDER BY `utilisateurs`.`id` ASC LIMIT 1
---
  def connexion
    @current_user = Utilisateurs.where(nom: params[:name], password: params[:password]).first