app/views/plan_action_type/index.html.erb

<%= flash[:auth_error]%>
<% if Droit.find(@current_user.droit_id).role  == "admin"%>
---
SELECT  `droits`.* FROM `droits` WHERE `droits`.`id` = 1 LIMIT 1

        <td><%= p.priorite%></td>
        <td><%= link_to p.anomaly_id.to_s<<" (Type = #{Anomalie.find(p.anomaly_id).alerte_type})", anomalie_show_url << "?id=#{p.anomaly_id}"%></td>
---
SELECT  `anomalies`.* FROM `anomalies` WHERE `anomalies`.`id` = 14 LIMIT 1